Repository: pypi-data/pypi-mirror-362
Catalog: packages/m9s-stock-package-shipping-dhl-*/m9s_stock_package_shipping_dhl_*-7.0.0-py3-none-any.whl/trytond/modules/stock_package_shipping_dhl_*/locale/*.po
Languages: de

# field:carrier,dhl_billing_number:
source: DHL Billing Number
de: DHL Abrechnungsnummer

# field:carrier,dhl_label_image_format:
source: Label Image Format
de: Bildformat Etikett

# field:carrier,dhl_label_size:
source: Label Size
de: Etikettgröße

# field:carrier,dhl_service_type:
source: Service Type
de: Dienstleistungstyp

# field:carrier.credential.dhl_de,company:
source: Company
de: Unternehmen

# field:carrier.credential.dhl_de,dhl_user:
source: DHL User
de: DHL Benutzer

# field:carrier.credential.dhl_de,password:
source: Password
de: Passwort

# model:carrier.credential.dhl_de,name:
source: DHL Credential
de: DHL Zugangsdaten

# model:ir.action,name:act_create_shipping_dhl_de_wizard
source: Create DHL DE Shipping for Packages
de: DHL DE Versand für Pakete erstellen

# model:ir.action,name:act_dhl_de_credential_form
source: DHL DE Credentials
de: DHL DE Zugangsdaten

# model:ir.message,text:dhl_de_webservice_error
source: The DHL DE webservice call failed with the following error message: %(message)s
de: Der Aufruf des DHL DE Webservice schlug fehl mit folgender Fehlermeldung: %(message)s

# model:ir.message,text:has_reference_number
source: Shipment "%(shipment)s" already has a reference number.
de: Lieferung "%(shipment)s" hat bereits eine Belegnummer.

# model:ir.message,text:missing_configuration
source: Missing configuration for company "%(company)s".
de: Fehlende Konfiguration für Unternehmen "%(company)s".

# model:ir.message,text:warehouse_address_required
source: An address is required for warehouse "%(warehouse)s".
de: Eine Adresse ist erforderlich für Warenlager "%(warehouse)s".

# model:ir.rule.group,name:rule_group_carrier_credential_dhl_de_companies
source: User in companies
de: Benutzer in Unternehmen

# model:ir.ui.menu,name:menu_dhl_de_credential_form
source: DHL DE Credentials
de: DHL DE Zugangsdaten

# selection:carrier.credential.dhl_de,server:
source: Production
de: Produktivumgebung

# selection:carrier.credential.dhl_de,server:
source: Testing
de: Testumgebung
