Repository: pypi-data/pypi-mirror-362
Catalog: packages/indico-plugin-vc-zoom/indico_plugin_vc_zoom-3.3.4-py3-none-any.whl/indico_vc_zoom/translations/*/LC_MESSAGES/messages.po
Languages: hu_hu

source: You were already an (alternative) host of this meeting
hu_hu: Ön már (alternatív) házigazdája volt ennek a találkozónak

source: Passcode visibility
hu_hu: Jelszó láthatósága

source: Who should be able to know this meeting's passcode
hu_hu: Kinek kell tudni a találkozó jelszavát

source: Everyone
hu_hu: Mindenki

source: Logged-in users
hu_hu: Bejelentkezett felhasználók

source: Registered participants
hu_hu: Regisztrált résztvevők

source: No one
hu_hu: Senki

source: Meeting Type
hu_hu: Találkozó típusa

source: The type of Zoom meeting to be created
hu_hu: A létrehozandó Zoom értekezlet típusa

source: Regular Meeting
hu_hu: Rendszeres értekezlet

source: Webinar
hu_hu: Webinárium

source: Meeting Host
hu_hu: Találkozó házigazdája

source: Myself
hu_hu: Én magam

source: Someone else
hu_hu: Valaki más

source: User
hu_hu: Felhasználó

source: Passcode
hu_hu: Jelszó

source: Meeting passcode (8-10 digits)
hu_hu: Találkozó kódja (8-10 számjegy)

source: Mute audio
hu_hu: Hang némítása

source: Participants will join the meeting muted by default
hu_hu: A résztvevők alapértelmezés szerint némán csatlakoznak a megbeszéléshez

source: Mute video (host)
hu_hu: Videó elnémítása (házigazda)

source: The host will join the meeting with video disabled
hu_hu: A házigazda kikapcsolt kameraképpel csatlakozik a megbeszéléshez

source: Mute video (participants)
hu_hu: Videó elnémítása (résztvevők)

source: Participants will join the meeting with video disabled
hu_hu: A résztvevők kikapcsolt kameraképpel csatlakoznak a megbeszéléshez

source: Waiting room
hu_hu: Várószoba

source: Participants may be kept in a waiting room by the host
hu_hu: A résztvevőket a házigazda egy váróteremben tarthatja

source: Description
hu_hu: Leírás

source: Optional description for this meeting
hu_hu: Választható leírás ehhez a megbeszéléshez

source: This user has no Zoom account
hu_hu: Ennek a felhasználónak nincs Zoom-fiókja

source: API Credentials
hu_hu: API-hitelesítő adatok

source: Zoom Account
hu_hu: Zoom-fiók

source: Room Settings
hu_hu: Szoba beállítások

source: Notifications
hu_hu: Értesítések

source: Access
hu_hu: Hozzáférés

source: Account ID
hu_hu: Fiók azonosító

source: Client ID
hu_hu: Ügyfél azonosít

source: Client Secret
hu_hu: Ügyfél titok

source: Webhook Secret Token
hu_hu: Webhook titkos token

source: Specify the "Secret Token" of your Zoom Webhook if you want live updates in case of modified/deleted Zoom meetings.
hu_hu: Adja meg a Zoom Webhook „titkos token"-jét, ha élő frissítéseket szeretne a módosított / törölt Zoom-értekezletek esetén.

source: User lookup mode
hu_hu: Felhasználói keresési mód

source: Specify how Indico should look up the zoom user that corresponds to an Indico user.
hu_hu: Adja meg, hogy az Indico hogyan keresse meg az Indico felhasználónak megfelelő zoomfelhasználót.

source: E-mail domains
hu_hu: E-mail domainek

source: List of e-mail domains which can use the Zoom API. Indico attempts to find Zoom accounts using all email addresses of a user which use those domains.
hu_hu: A Zoom API-t használó e-mail domainek listája. Az Indico megkísérli megtalálni a Zoom-fiókokat a felhasználó összes e-mail címének felhasználásával, amely ezeket a domaineket használja.

source: Indico identity providers
hu_hu: Indico identitásszolgáltatók

source: Identity providers from which to get usernames. Indico queries those providers using the email addresses of the user and attempts to find Zoom accounts having an email address with the format username@enterprise-domain.
hu_hu: Azon identitásszolgáltatók, ahonnan a felhasználóneveket meg lehet szerezni. Az Indico lekérdezi azokat a szolgáltatókat, amelyek a felhasználó e-mail címeit használják, és megpróbálja megtalálni a Zoom fiókokat, amelyek e-mail címmel rendelkeznek a felhasználónév @ vállalati domain formátummal.

source: Enterprise domain
hu_hu: Vállalati tartomány

source: The domain name used together with the usernames from the Indico identity provider
hu_hu: Az Indico identitásszolgáltató felhasználóneveivel együtt használt domain név

source: Allow Webinars (Experimental)
hu_hu: Webes szemináriumok engedélyezése (kísérleti)

source: Allow webinars to be created through Indico. Use at your own risk.
hu_hu: Lehetővé teszi a webes szemináriumok létrehozását az Indico segítségével. Használat csak saját felelősségre.

source: Join Before Host
hu_hu: Csatlakozás a Host előtt

source: Allow participants to join the meeting before the host starts the meeting. Only used for scheduled or recurring meetings.
hu_hu: Engedje meg a résztvevőknek, hogy csatlakozzanak az értekezlethez, mielőtt a házigazda megkezdi az értekezletet. Csak ütemezett vagy ismétlődő megbeszélésekre használható.

source: Creation email footer
hu_hu: Létrehozási e-mail lábléc

source: Footer to append to emails sent upon creation of a Zoom meeting
hu_hu: Lábléc a Zoom megbeszélés létrehozásakor küldött e-mailekhez

source: Send host URL
hu_hu: Gép URL küldése

source: Whether to send an e-mail with the Host URL to the meeting host upon creation of a meeting
hu_hu: Hogy küldjön-e e-mailt a gazdagép URL-jével az értekezlet-házigazdának az ülés létrehozása után

source: Join via phone
hu_hu: Csatlakozás telefonról

source: Link to instructions on joining a meeting via phone
hu_hu: Link az értekezlethez telefonos csatlakozásra vonatkozó utasításokhoz

source: Invalid identity providers: {}
hu_hu: Érvénytelen identitásszolgáltatók: {}

source: Zoom credentials not set; the plugin will not work correctly
hu_hu: A zoom hitelesítő adatok nincsenek beállítva; a plugin nem fog megfelelően működni.

source: Successfully got a Zoom token ({})
hu_hu: Sikeresen megszerezte a Zoom tokent ({})

source: Could not get Zoom token: {}
hu_hu: Nem sikerült megszerezni a Zoom tokent: {}

source: The meeting "{}" is using Zoom registration and thus cannot be attached to another event
hu_hu: A(z) „{}” megbeszélés a Zoom regisztrációt használja, ezért nem csatolható más eseményhez

source: Could not create the meeting in Zoom. Please contact support if the error persists
hu_hu: Nem sikerült létrehozni a megbeszélést a Zoomban. Kérjük, forduljon az ügyfélszolgálathoz, ha a hiba továbbra is fennáll

source: Meeting didn't exist in Zoom anymore
hu_hu: A megbeszélés már nem létezett a Zoomban

source: Zoom Error: "{}"
hu_hu: Nagyítási hiba: "{}"

source: Problem deleting Zoom meeting
hu_hu: Probléma a Zoom megbeszélés törlésével

source: The meeting "{}" no longer exists in Zoom and was removed from the event
hu_hu: A(z) „{}” megbeszélés már nem létezik a Zoomban, és eltávolításra került az eseményből

source: The meeting "{}" is using Zoom registration and thus cannot be attached to the new event
hu_hu: A(z) „{}” megbeszélés a Zoom regisztrációt használja, ezért nem csatolható az új eseményhez.

source: All emails
hu_hu: Minden e-mail

source: Email domains
hu_hu: E-mail domainek

source: Authenticators
hu_hu: Hitelesítők

source: This meeting has been deleted from Zoom
hu_hu: Ez a megbeszélés törlésre került a Zoomból

source: Problem fetching meeting from Zoom. Please contact support if the error persists.
hu_hu: Probléma az megbeszélés lekérése a Zoomból. Kérjük, forduljon az ügyfélszolgálathoz, ha a hiba továbbra is fennáll.

source: Meeting no longer exists in Zoom
hu_hu: A találkozó már nem létezik a Zoomban

source: Can't update meeting. Please contact support if the error persists.
hu_hu: Nem sikerült frissíteni az értekezletet. Kérjük, vegye fel a kapcsolatot az ügyfélszolgálattal, ha a hiba továbbra is fennáll.

source: Could not find Zoom user for alternative host
hu_hu: Nem található Zoom felhasználó alternatív gazdagéphez

source: Join the Zoom Meeting
hu_hu: Csatlakozás a Zoom megbeszéléshez

source: Join
hu_hu: Csatlakozás

source: You will need a passcode to join this Zoom meeting
hu_hu: Szüksége lesz egy kódra, hogy csatlakozzon ehhez a Zoom értekezlethez

source: This Zoom Meeting can only be seen by registered participants
hu_hu: Ezt a Zoom értekezletet csak regisztrált résztvevők láthatják

source: Please register
hu_hu: Kérem regisztráljon

source: Registration required
hu_hu: Regisztráció szükséges

source: Please log in and register
hu_hu: Kérjük, jelentkezzen be és regisztráljon

source: This Zoom Meeting can only be seen by logged in users
hu_hu: Ezt a Zoom értekezletet csak a bejelentkezett felhasználók láthatják

source: Please log in
hu_hu: Az oldal eléréséhez kérjük jelentkezzen be.

source: The host of this Zoom meeting is <strong>%(host)s</strong>. In case you want to delete this Zoom meeting from all events, please make sure that they do not use it for other events that may still need it!
hu_hu: A Zoom-értekezlet házigazdája <strong>%(host)s</strong> . Abban az esetben, ha törölni szeretné ezt a Zoom találkozót az összes esemény közül, győződjön meg róla, hogy nem használják más eseményekre, amelyekre még szüksége lehet rá!

source: Zoom Meeting ID
hu_hu: Zoom értekezlet azonosítója

source: Host
hu_hu: Kiszolgáló

source: Alternative host
hu_hu: Alternatív gazda

source: Useful links
hu_hu: Hasznos Linkek

source: Linked to
hu_hu: Kapcsolódó

source: the whole event
hu_hu: az egész esemény

source: Contribution
hu_hu: Felszólalás

source: Session
hu_hu: Szekció

source: Created on
hu_hu: Létrehozták

source: Modified on
hu_hu: Módosult

source: This is a Zoom webinar
hu_hu: Ez egy Zoom webinárium
