Repository: pypi-data/pypi-mirror-362
Catalog: packages/pyams-elastic/pyams_elastic-2.1.1.tar.gz/pyams_elastic-2.1.1/src/pyams_elastic/locales/*/LC_MESSAGES/pyams_elastic.po
Languages: fr

source: Hosts
fr: Hôtes

source: Newline separated list of Elasticsearch servers URLs, including protocol
fr: Liste des adresses des serveurs Elasticsearch ; vous pouvez indiquer un serveur par ligne, sous forme simplifiée (hostname:port) ou complète (https://username:password@hostname:port)

source: Cloud ID
fr: ID cloud

source: Elasticsearch cloud identifier
fr: Identifiant cloud Elasticsearch

source: Either hosts or cloud ID must be specified!
fr: Vous devez spécifier une liste d'hôtes ou un ID cloud !

source: API key
fr: Clé d'API

source: API key and secret, separated by ':'
fr: Clé d'API et code secret, séparés par ':'

source: Basic authentication
fr: Authentification basique

source: Username and password used for basic authentication, separated by ':'
fr: Code utilisateur et mot de passe utilisés pour l'authentification basique, séparés par ':'

source: Bearer authentication
fr: Authentification Bearer

source: Token used for Bearer authentication
fr: Jeton d'authentification Bearer

source: Verify certificates?
fr: Vérifier les certificats

source: If 'no', SSL certificates will not be verified
fr: Si 'non', les certificats SSL ne seront pas vérifiés

source: CA certificates
fr: Certificats de la CA

source: Path to certificates of certification authority
fr: Chemin d'accès aux certificats de l'autorité de certification

source: Client certificate
fr: Certificat client

source: Path to PEM file containing client certificate
fr: Chemin d'accès à un fichier PEM contenant le certificat du client

source: Client key
fr: Clé du certificat

source: Path to PEM file containing client key, if not included with client certificate
fr: Chemin d'accès à un fichier PEM contenant la clé du certificat du client, si elle n'est pas inclue avec le certificat du client

source: Index name
fr: Nom de l'index

source: Elasticsearch index name or pattern
fr: Vous pouvez indiquer un nom d'index, ou un motif comme dans "hearbeat-*"

source: Timeout
fr: Délai d'attente

source: Request timeout, in seconds
fr: Délai d'attente de réponse aux requêtes, en secondes

source: Timeout retries
fr: Nouvelles tentatives

source: You can define the number of retries which can be done if a timeout occurs; setting this to 0 disable retries
fr: Si une requête échoue à cause d'un délai d'attente dépassé, vous pouvez indiquer le nombre de nouvelles tentatives qui pourront être effectuées

source: Elasticsearch query
fr: Requête Elasticsearch

source: Elasticsearch re-indexer
fr: Ré-indexation Elasticsearch

source: Elasticsearch connection
fr: Connexion Elasticsearch

source: Query
fr: Requête

source: Complete Elasticsearch query, in JSON format; you can include dynamic fragments into your JSON code using PyAMS text renderers rules (see documentation)
fr: Indiquez ici le contenu de la requête Elasticsearch, au format JSON ; vous pouvez intégrer des éléments dynamiques dans le code JSON en appliquant les règles des outils de formatage de texte proposés par PyAMS (Cf documentation) ; dans le cas où cette tâche est exécutée au sein d'un pipeline, vous pouvez également intégrer des paramètres d'entrée sous la forme "${{param:nom_du_parametre}}"

source: Expected results count
fr: Nombre de résultats attendu

source: Number of expected results; you can enter a single number, or a range by entering two numbers separated by a dash; an error status will be returned if the number of results is not in the given range; if the input is left empty, all queries will return an error
fr: Nombre de résultats attendu ; vous pouvez indiquer un nombre entier, ou un intervalle en indiquant deux nombres entiers séparés par un tiret ; un statut d'erreur sera produit si le nombre de résultats n'est pas dans l'intervalle ; si la valeur est laissée vide, toutes les requêtes généreront une erreur

source: Expected results must be a single positive number, or two positive numbers separated by a dash
fr: Le nombre de résultats attendu doit être soit un nombre entier positif, soit un intervalle composé de deux nombres entiers séparés par un tiret

source: Output fields
fr: Attributs en sortie

source: If this task in run into a pipeline, this is the list of fields which will be provided to the next task as input instead of the raw Elasticsearch query results; you can redefine fields names using a syntax like "new.name=some.field.name"
fr: Si cette tâche est exécutée au sein d'un pipeline, ceci est la liste des champs qui seront extraits du résultat de la requête et transmis comme paramètres d'entrée à la tâche suivante ; si cette liste est laissée vide, c'est le résultat brut de la requête qui sera utilisé ; vous pouvez renommer un champ en utilisant la syntaxe "nouveau.champ=nom.ancien.champ"

source: Log output fields
fr: Attributs du rapport d'exécution

source: List of results fields to include in task log output report
fr: Liste des champs présents dans le rapport d'exécution ; ATTENTION !, n'oubliez pas d'intégrer ces champs si nécessaire dans la liste des champs renvoyés par la requête !

source: Source connection
fr: Connexion source

source: Source query
fr: Requête source

source: Source fields
fr: Attributs source

source: List of fields extracted from source query results which will be parsed and inserted into target index
fr: Liste des attributs extraits de la requête source ; seuls ces attributs seront extraits de la source et insérés dans l'index cible (en conservant le même ID). Vous pouvez renommer ces attributs en les indiquant sous la forme 'target_name=source.name'. Si le nom de l'attribut dans la source correspond à un objet, ce sont tous les attributs de cet objet qui seront repris.

source: Page size
fr: Taille de page

source: Maximum number of hits returned in a single query
fr: Nombre maximum d'éléments retournés par une requête

source: Target connection
fr: Connexion cible

source: Elasticsearch task settings
fr: Requête Elasticsearch

source: Add Elasticsearch query...
fr: Requête Elasticsearch

source: Elasticsearch reindex task settings
fr: Ré-indexation Elasticsearch

source: Add Elasticsearch reindex...
fr: Ré-indexation Elasticsearch
