Repository: pypi-data/pypi-mirror-362
Catalog: packages/flowstrider/flowstrider-1.0.1.tar.gz/flowstrider-1.0.1/src/flowstrider/localization/*/LC_MESSAGES/messages.po
Languages: de

source: id "{id}" was used for more than one object in the dfd.
de: id "{id}" wurde für mehr als ein Objekt in dem dfd genutzt.

source: element name "{name}" does not correspond with its id "{id}".
de: Elementenname "{name}" korrespondiert nicht mit dessen id "{id}".

source: tag "{tag}" is not a valid tag.
de: Tag "{tag}" ist kein valider Tag.

source: id "{id}" was referenced but not found.
de: id "{id}" wurde referenziert aber nicht gefunden.

source: attribute "{att}" is not a valid attribute.
de: Attribut "{att}" ist kein valides Attribut.

source: attribute "{att}" is not applicable for an element of type {tag}.
de: Attribut "{att}" ist nicht anwendbar für ein Element des Typen {tag}.

source: Warning:
de: Warnung:

source: line
de: Zeile

source: Elicit threats.
de: Nach Bedrohungen prüfen.

source: Path to dataflow diagram (in .json) you want to elicit.
de: Pfad zum Datenflussdiagramm (in .json), das Sie prüfen möchten.

source: Path to threat management information file (.json). Will be created if it does not exist.
de: Pfad zur Bedrohungsmanagementinformationsdatei (.json). Wird erstellt, falls sie nicht existiert.

source: Option to save threats as PDF file.
de: Option Bedrohungen als PDF-Datei zu speichern.

source: Tool fails when it identifies a threat with the given management state.
de: Das Programm schlägt fehl, wenn eine Bedrohung mit gegebenen Management Statusidentifiziert wird.

source: Changes output language for elicitation and PDF.
de: Ändert die Ausgabesprache für die Gefahrenprüfung und die PDF.

source: Give list of metadata you may want to add.
de: Geben Sie eine Liste der Metadaten an, die Sie hinzufügen möchten.

source: Path to dataflow diagram in (.json) you want the metadata from.
de: Pfad zum Datenflussdiagramm (.json), aus dem Sie die Metadaten benötigen.

source: Changes output language for XLSX file.
de: Ändert die Ausgabesprache für die XLSX-Datei.

source: Update metadata for a dfd.json from metadata.xlsx file.
de: Aktualisieren Sie die Metadaten für eine dfd.json-Datei mit Metadaten aus der Datei metadata.xlsx.

source: Path to dataflow diagram (in .json) you want to update.
de: Pfad zum Datenflussdiagramm (in .json), das Sie aktualisieren möchten.

source: Path to metadata file (in .xlsx) you want to add.
de: Pfad zur Metadatendatei (in .xlsx), die Sie hinzufügen möchten.

source: Print version information.
de: Versionsinformationenen ausgeben.

source: FlowStrider - FlowStrider automates data flow-based threat modeling
de: FlowStrider - Einfaches, graphenbasiertes Tool zur System-Bedrohungsmodellierung

source: Copyright (C) 2025 German Aerospace Center DLR
de: Copyright (C) 2025 Deutsches Zentrum für Luft- und Raumfahrt (DLR)

source: Error: Specified file '{path}' not found. Check that the file exists and that the location is correct.
de: Error: Die angegebene Datei '{path}' wurde nicht gefunden. Überprüfen Sie, ob die Datei vorhanden ist und ob der Speicherort korrekt ist.

source: Error: '{path}' is a directory, please specify the path to a .json file.
de: Error: '{path}' ist ein Verzeichnis. Geben Sie bitte den Pfad zu einer JSON-Datei an.

source: Error: No permission to access '{path}'.Please specify a valid path to a .json file.
de: Error: Keine Berechtigung um auf '{path}' zuzugreifen. Bitte geben Sie einen gültigen Pfad zu einer JSON-Datei an.

source: Error: There is a json error in file '{path}': {err}.
de: Error: In der Datei '{path}' liegt ein JSON-Fehler vor: {err}.

source: There was 1 warning!
de: Es gab eine Warnung!

source: Results saved as PDF to 'output/{id}_threats.pdf'. Diagram saved as PNG, SVG and Graphviz to the output/visualization folder.
de: Ergebnisse gespeichert als PDF zu 'output/{id}_threats.pdf'. Diagramme als PNG, SVG und Graphviz wurden in den output/visualization ordner gespeichert.

source: No or wrong output format specified. Threats were not saved.
de: Kein oder falsches Ausgabeformat angegeben. Bedrohungen wurden nicht gespeichert.

source: The following threats caused a failure. Selected level: {level}
de: Folgende Bedrohungen haben Fehler hervorgerufen. Gewähltes Level: {level}

source: Used rule collections:
de: Genutzte Regelsammlungen:

source: There were no threats found.
de: Es wurden keine Bedrohungen gefunden.

source: One threat has been found.
de: Eine Bedrohung wurde gefunden.

source: One different threat
de: Eine verschiedene Bedrohung

source: and a total of one involved location
de: und insgesamt eine involvierte Position

source: #{number} Threat source: {src}
de: #{number} Bedrohungsquelle: {src}

source: Description:
de: Beschreibung:

source: Long Description:
de: Lange Beschreibung:

source: Mitigation Option:
de: Risikominderungsoption:

source: Requirement:
de: Bedingung:

source: Locations:
de: Positionen:

source: Management State:
de: Management Status:

source: Management Explanation:
de: Management Erklärung:

source: References:
de: Quellen:

source: BSI IT-Grundschutzkompendium checklist:
de: BSI IT-Grundschutzkompendium Checkliste:

source: Error: '{path}' is a directory. Please specify the path to a .json file.
de: Error: '{path}' ist ein Verzeichnis. Bitte geben Sie den Pfad zu einer JSON-Datei an.

source: Metadata file of diagram '{id}' saved to 'output/{id}_metadata_overview.xlsx'. After modifying the metadata you can update the data-flow diagram with the command 'update'.
de: Metadatendatei des Diagramms '{id}' gespeichert unter 'output/{id}_metadata_overview.xlsx'. Nachdem Sie die Metadaten geändert haben, können Sie das Datenflussdiagramm mit dem Befehl 'update' aktualisieren.

source: Error: Specified dfd file '{path}' not found. Check that the file exists and that the location is correct.
de: Error: Die angegebene DFD-Datei '{path}' wurde nicht gefunden. Überprüfen Sie, ob die Datei vorhanden ist und ob der Speicherort korrekt angegeben ist.

source: Error: '{path}' is of wrong file format. Please specify the path to a .xlsx file.
de: Error: '{path}' hat das falsche Dateiformat. Bitte geben Sie den Pfad zu einer .xlsx-Datei an.

source: Error: No permission to access '{path}'.Please specify a valid path to a .xlsx file.
de: Error: kein Berechtigung um auf '{path}' zuzugreifen. Bitte geben Sie einen gültigen Pfad zu einer .xlsx-Datei an.

source: Successfully updated diagram '{id}' in file '{path}'.
de: Diagramm '{id}' in Datei '{path}' erfolgreich aktualisiert.

source: Entity Type
de: Entitätstyp

source: Entity ID
de: Entitäts-ID

source: Entity Name
de: Entitätsname

source: Attributes
de: Attribute

source: Generated by FlowStrider for the data flow diagram '{id}'.
de: Generiert von FlowStrider für das Datenflussdiagramm '{id}'.

source: The 'Attributes' sheet contains an overview of the attributes currently assigned to each entity in the data flow diagram. The three left most columns indicate each entity with type, ID and name. The other columns mark the different attributes with a short explanation for each. Each row indicates one entity with the corresponding values for the attributes it currently has. 'Missing' means that the value for the respective attribute hasn't been defined yet. Those cells are colored in a light red. Cells in bright red mean that the given value is invalid for this attribute and will most likely lead to a threat being detected in the elicit phase. If the cell is colored green, the value corresponds to one of the valid ones and will most likely not lead to a threat. Cells that are left blank mean that the attribute cannot be defined for the entity. For changing the values of the attributes, click in one of the not blank cells and either input a custom value or use the drop down menu to select one of the valid options. Afterwards, the .xlsx file can be saved and can now be used to update the data flow diagram with the 'update' command.
de: Das Tabellenblatt 'Attribute' enthält eine Übersicht über die Attribute, die aktuell den Entitäten im Datenflussdiagramm zugewiesen sind. Die drei linken Spalten zeigen jede Entität mit Typ, ID und Name an. Die übrigen Spalten kennzeichnen die verschiedenen Attribute mit je einer kurzen Erklärung. Jede Zeile zeigt eine Entität mit den entsprechenden Werten für die aktuellen Attribute an. 'Missing' bedeutet, dass der Wert für das jeweilige Attribut noch nicht definiert wurde. Diese Zellen sind hellrot markiert. Zellen in leuchtendem Rot bedeuten, dass der angegebene Wert für dieses Attribut ungültig ist und höchstwahrscheinlich zu einer Bedrohung in der Prüfphase führt. Ist die Zelle grün markiert, entspricht der Wert einem der gültigen Werte und führt höchstwahrscheinlich nicht zu einer Bedrohung. Leere Zellen bedeuten, dass das Attribut für die Entität nicht definiert werden kann. Um die Werte der Attribute zu ändern, klicken Sie in eine der nicht leeren Zellen und geben Sie entweder einen benutzerdefinierten Wert ein oder wählen Sie im Dropdown-Menü eine der gültigen Optionen aus. Anschließend kann die .xlsx-Datei gespeichert und das Datenflussdiagramm mit dem Befehl 'update' aktualisiert werden.

source: Please note that the changes made in this file will not be applied to the data flow diagram automatically. For changes in this file to be applied, use the 'update' command with your data flow diagram and this file after saving it.
de: Bitte beachten Sie, dass die in dieser Datei vorgenommenen Änderungen nicht automatisch auf das Datenflussdiagramm angewendet werden. Um Änderungen in dieser Datei zu übernehmen, verwenden Sie nach dem Speichern den Befehl 'update' mit Ihrem Datenflussdiagramm und dieser Datei.

source: Entity {id} could not be identified. Unknown entity type: {type}
de: Entität {id} konnte nicht identifiziert werden. Unbekannte Entität. Typ: {type}

source: Entity {id} could not be found
de: Entität {id} konnte nicht gefunden werden

source: Automated Threat Modeling Results
de: Ergebnis der Automatisierten Gefahrenmodellierung

source: Project: {name}
de: Projekt: {name}

source: Generated on: {today}
de: Generiert am: {today}

source: The following threats were elicited:
de: Folgende Bedrohungen wurden gefunden:

source: Authentication factors
de: Authentifizierungsfaktoren

source: If authentication is required, which factors will be needed for authentication. Examples: ['PIN', 'Chip Card', 'OTP'] or ['Digital Certificate', 'Biometric Data'].
de: Welche Faktoren zur Authentifizierung benötigt werden, falls eine Authentifizierung erforderlich ist. Beispiele: ['PIN', 'Chip Card', 'OTP'] oder ['Digital Certificate', 'Biometric Data'].

source: Authentication protocol
de: Authentifizierungsprotokoll

source: Which authentication protocol will be used to ensure integrity. Examples: 'DH_CHAP' or 'FCPAP'
de: Welches Authentifizierungsprotokoll zur Gewährleistung der Integrität verwendet wird. Beispiele: 'DH_CHAP' or 'FCPAP'

source: Requires authentication
de: Erfordert Authentifizierung

source: Whether any form of authentication is required to access the entity.
de: Ob für den Zugriff auf die Entität eine Form der Authentifizierung erforderlich ist.

source: Encryption method
de: Verschlüsselungsmethode

source: Which method of encryption will be used to encrypt the data. Examples: 'AES_128' or 'AES_256'
de: Welche Verschlüsselungsmethode für die Daten verwendet wird. Beispiele: 'AES_128' oder 'AES_256'

source: Given permissions
de: Erteilte Berechtigungen

source: Actions the actor is priviliged to perform.
de: Aktionen, die der Akteur ausführen darf.

source: Handles confidential data
de: Behandelt vertrauliche Daten

source: Whether the entity handles confidential data.
de: Ob die Entität vertrauliche Daten verarbeitet.

source: Handles logs
de: Verarbeitet Protokolle

source: Whether the DataStore handles protocol logging data.
de: Ob der DataStore Protokolldaten verarbeitet.

source: Hash function
de: Hash-Funktion

source: Which function will be used to store hashed data. Examples: 'SHA3_256' or 'SHA_512_256'.
de: Welche Funktion zum Speichern von Hash-Daten verwendet wird. Beispiele: 'SHA3_256' oder 'SHA_512_256'.

source: If applicable, which http headers are set. Example: ['Content Type', 'Cache Control'].
de: Welche HTTP-Header gesetzt sind, falls anwendbar. Beispiel: ['Content Type', 'Cache Control'].

source: Is SAN fabric
de: Ist SAN-Fabric

source: Defines, if the entity is part of the fabric layer of a storage area network.
de: Gibt an, ob die Entität Teil der Fabric-Schicht eines Speicherbereichsnetzwerks (SAN) ist.

source: Input data
de: Eingabedaten

source: All types of handled data. Example: ['Session IDs', 'User Requests'].
de: Alle Arten von verarbeiteten Daten. Beispiel: ['Session IDs', 'User Requests'].

source: Input validation
de: Eingabevalidierung

source: Defines, if the input data is validated.
de: Gibt an, ob die Eingabedaten validiert sind.

source: Integrity check
de: Integritätsprüfung

source: If an integrity check (such as a check sum) is used, this should note the specific check. Examples: 'check sum' or 'digital certificate'.
de: Wird eine Integritätsprüfung (z.B. eine Prüfsumme) verwendet, ist hier die spezifische Prüfung anzugeben. Beispiele: 'check sum' oder 'digital certificate'.

source: Uses proxy
de: Verwendet Proxy

source: Whether the dataflow is routed through a TLS-proxy
de: Ob der Datenfluss über einen TLS-Proxy geleitet wird

source: Required permissions
de: Erforderliche Berechtigungen

source: Which priviliges are required to interact with the process.
de: Welche Berechtigungen für die Interaktion mit dem Prozess erforderlich sind

source: Signature scheme
de: Signaturschema

source: If a signature scheme is used, this should note the specific scheme. Examples:'RSA' or 'ECDSA' or 'LMS'.
de: Falls ein Signaturschema verwendet wird, sollte hier das spezifische Schema angegeben werden. Beispiele: 'RSA', 'ECDSA' oder 'LMS'.

source: Stores credentials
de: Speichert Anmeldeinformationen

source: Whether the DataStore stores Login Credentials or other authentication data.
de: Ob der DataStore Anmeldeinformationen oder andere Authentifizierungsdaten speichert.

source: Transport protocol
de: Transportprotokoll

source: Which transport protocol the dataflow uses.
de: Welches Transportprotokoll der Datenfluss verwendet.

source: Attribute missing: {name}
de: Attribut fehlt: {name}

source: Eliciting threats for model {id}
de: Prüfe nach Bedrohungen für Modell {id}

source: Untrustworthy Data Flow
de: Nicht vertrauenswürdiger Datenfluss

source: : one of {
de: : eins von {

source: Confidential Data Flow
de: Vertraulicher Datenfluss

source: Secure HTTP Configuration
de: Sichere HTTP-Konfiguration

source: : all of {
de: : alle von {

source: Integrity of External Entities
de: Integrität Externer Entitäten

source: Use of Proxies
de: Einsatz von Proxys

source: Signature of Logging Data
de: Signatur von Protokolldaten

source: Hashing of Passwords
de: Hashing von Passwörtern

source: Encryption of Confidential Data
de: Verschlüsselung Vertraulicher Daten

source: Authentication Protocols for SAN fabric
de: Authentifizierungsprotokolle für SAN-Fabric

source: Multi Factor Authentication
de: Multi-Faktor-Authentifizierung

source: : count >= 2
de: : Anzahl >= 2

source: Multi Factor Authentication for High Security
de: Multi-Faktor-Authentifizierung für Hohe Sicherheit

source: Least Privileges
de: Geringste Berechtigungen

source: same as
de: gleich wie

source: Input Validation
de: Eingabevalidierung

source: and
de: und

source: BSI rule collection
de: BSI Regelsammlung

source: Generic Spoofing Node Rule
de: Generische Spoofing Knoten Regel

source: Generic Spoofing Threat
de: Generische Spoofing Gefahr

source: Spoofing refers to the attack where an adversary gains unauthorized access to data or a system by falsifying their identity and pretending to be a trusted contact. The threat violates the property of authenticity.
de: Spoofing bezeichnet einen Angriff, bei dem sich ein Angreifer unbefugten Zugriff auf Daten oder ein System verschafft, indem er seine Identität fälscht und sich als vertrauenswürdiger Kontakt ausgibt. Diese Bedrohung verletzt die Eigenschaft der Authentizität.

source: Generic Tampering Node Rule
de: Generische Tampering Knoten Regel

source: Generic Tampering Threat
de: Generische Tampering Gefahr

source: Tampering refers to the unlawful modification of data or systems so that they pose a danger to normal users. The threat violates the property of integrity.
de: Tampering (Manipulation) bezeichnet die unrechtmäßige Veränderung von Daten oder Systemen, sodass diese eine Gefahr für normale Nutzer darstellen. Die Bedrohung verletzt die Eigenschaft der Integrität.

source: Generic Tampering Dataflow Rule
de: Generische Tampering Datenfluss Regel

source: Generic Repudiation Node Rule
de: Generische Repudiation Knoten Regel

source: Generic Repudiation Threat
de: Generische Repudiation Gefahr

source: Repudiation refers to the threat where a contact does not claim responsibility and rejects the confession of a certain act like modifying data. The threat violates the property of non-repudiability.
de: Repudiation (Verleugnung) bezeichnet die Bedrohung, bei der ein Kontakt keine Verantwortung übernimmt und das Geständnis einer bestimmten Handlung, wie beispielsweise der Änderung von Daten, ablehnt. Die Drohung verletzt die Eigenschaft der Nichtabstreitbarkeit.

source: Generic Information Disclosure Node Rule
de: Generische Information Disclosure Knoten Regel

source: Generic Information Disclosure Threat
de: Generische Information Disclosure Gefahr

source: Information disclosure refers to the threat where data leaves the confines of its supposed authority scope and unauthorized contacts can access it. The threat violates the property of confidentiality.
de: Information disclosure (Offenlegung von Informationen) bezeichnet die Bedrohung, bei der Daten den vorhergesehenen Zuständigkeitsbereich verlassen und unbefugte Kontakte darauf zugreifen können. Diese Bedrohung verletzt die Eigenschaft der Vertraulichkeit.

source: Generic Information Disclosure Dataflow Rule
de: Generische Information Disclosure Datenfluss Regel

source: Generic Denial of Service Node Rule
de: Generische Denial of Service Knoten Regel

source: Generic Denial of Service Threat
de: Generische Denial of Service Gefahr

source: Denial of service refers to the threat of maliciously overloading the resources of the system with the intent of harming usability and making services unavailable. The thrat violates the property of availability.
de: Denial-of-Service bezeichnet die Bedrohung durch eine böswillige Überlastung der Systemressourcen mit der Absicht, die Nutzbarkeit zu beeinträchtigen und Dienste unzugänglich zu machen. Diese Bedrohung verletzt die Eigenschaft der Verfügbarkeit.

source: Generic Denial of Service Dataflow Rule
de: Generische Denial of Service Datenfluss Regel

source: Generic Elevation of Privilege Node Rule
de: Generische Elevation of Privilege Knoten Regel

source: Generic Elevation of Privilege Threat
de: Generische Eleavation of Privilege Gefahr

source: Elevation of privilege refers to the threat where an adversary can gain unlawful authorization to systems or data by escalating their level of privileges by exploiting bugs or gaps in security. The threat violates the property of authorization.
de: Elevation of privilege (Rechteausweitung) bezeichnet die Bedrohung, bei der ein Angreifer durch Ausnutzung von Sicherheitslücken oder Bugs unrechtmäßig Zugriff auf Systeme oder Daten erlangen kann, indem er seine Berechtigungen erhöht. Diese Bedrohung verletzt die Eigenschaft der Authorisierung.

source: STRIDE rule collection
de: STRIDE Regelsammlung
