Repository: pypi-data/pypi-mirror-362
Catalog: packages/collective.exportimport/collective_exportimport-1.15.tar.gz/collective_exportimport-1.15/src/collective/exportimport/locales/*/LC_MESSAGES/collective.exportimport.po
Languages: es

source: <p>Creation- and modification-dates are changed during import.This resets them to the original dates of the imported content.</p>
es: <p>Las fechas de creación y modificación se cambian durante la importación. Esto las restablece a las fechas originales del contenido importado.</p>

source: <p>This fixes invalid collection-criteria that were imported from Plone 4 or 5.</p>
es: <p>Esto corrige los criterios de recopilación no válidos que se importaron de Plone 4 o 5.</p>

source: Beware that this import would work only if you keep the same Plone site id and location in the site !
es: ¡Tenga en cuenta que esta importación solo funcionaría si mantiene la misma identificación y ubicación del sitio de Plone en el sitio!

source: Changed {} default pages
es: Se cambiaron {} páginas predeterminadas

source: Choose one
es: Elige uno

source: Content Types to export
es: Tipos de contenido para exportar

source: Created {} portlets
es: Creados {} portlets

source: Depth
es: Profundidad

source: Do a commit after each number of items
es: Haz una confirmación después de cada número de elementos

source: Download to local machine
es: Descargar a la máquina local

source: Exception during upload: {}
es: Excepción durante la carga: {}

source: Export
es: Exportar

source: Export comments
es: Exportar comentarios

source: Export content
es: Exportar contenido

source: Export default pages
es: Exportar páginas predeterminadas

source: Export local roles
es: Exportar roles locales

source: Export members
es: Exportar miembros

source: Export members, groups and roles
es: Exportar miembros, grupos y roles

source: Export object positions in parent
es: Exportar posiciones de objetos en el padre

source: Export ordering
es: Exportar ordenamiento

source: Export portlets
es: Exportar portlets

source: Export redirects
es: Exportar redireccionamientos

source: Export relations
es: Exportar relaciones

source: Export translations
es: Exportar traducciones

source: Exported to {}
es: Exportado a {}

source: Exported {} items ({}) as {} to {}
es: Exportado {} elementos ({}) como {} a {}

source: Exported {} {}
es: Exportado {} {}

source: Exports
es: Exportaciones

source: Failure while uploading: {}
es: Error al cargar: {}

source: File '{}' not found on server.
es: Archivo '{}' no encontrado en el servidor.

source: File on server to import:
es: Archivo en el servidor para importar:

source: Finished fixing collection queries.
es: Se terminaron de arreglar las consultas de colección.

source: Finished resetting creation and modification dates.
es: Finalizó el restablecimiento de las fechas de creación y modificación.

source: Fix collection queries
es: Arreglar consultas de colección

source: Fix links to content and images in richtext
es: Corregir enlaces a contenido e imágenes en texto enriquecido

source: Fixed HTML for {} fields in content items
es: HTML corregido para {} campos en elementos de contenido

source: Fixed HTML for {} portlets
es: HTML corregido para {} portlets

source: Handle existing content
es: Manejar el contenido existente

source: Help
es: Ayuda

source: Here is a example for the expected format. This is the format created by collective.exportimport when used for export.
es: Aquí hay un ejemplo para el formato esperado. Este es el formato creado por el collective.exportimport cuando se utiliza para la exportación.

source: Here is an example for the expected format. This is the format created by collective.exportimport when used for export.
es: Aquí hay un ejemplo para el formato esperado. Este es el formato creado por el collective.exportimport cuando se utiliza para la exportación.

source: Here you can upload a json-file.
es: Aquí puede cargar un archivo json.

source: How should content be handled that exists with the same id/path?
es: ¿Cómo se debe manejar el contenido que existe con el mismo id/path?

source: How should data from image- and file-fields be included?
es: ¿Cómo se deben incluir los datos de los campos de imagen y archivo?

source: Ignore: Create with a new id
es: Ignorar: Crear con un nuevo id

source: Import
es: Importar

source: Import Content
es: Importar Contenido

source: Import Default Pages
es: Importar páginas predeterminadas

source: Import Discussion
es: Importar discusión

source: Import Localroles
es: Importar roles locales

source: Import Members, Groups and their Roles
es: Importar miembros, grupos y sus roles

source: Import Object Positions in Parent
es: Importar posiciones de objetos en el padre

source: Import Redirects
es: Importar redireccionamientos

source: Import Relations
es: Importar relaciones

source: Import all items into the current folder
es: Importar todos los elementos a la carpeta actual

source: Import all old revisions
es: Importar todas las revisiones antiguas

source: Import comments
es: Importar comentarios

source: Import content
es: Importar contenido

source: Import default pages
es: Importar páginas predeterminadas

source: Import local roles
es: Importar roles locales

source: Import members
es: Importar miembros

source: Import object positions in parent
es: Importar posiciones de objetos en el padre

source: Import portlets
es: Importar portlets

source: Import redirects
es: Importar redireccionamientos

source: Import relations
es: Importar relaciones

source: Import translations
es: Importar traducciones

source: Imported {} comments
es: Importados {} comentarios

source: Imported {} groups and {} members
es: Importados {} grupos y {} miembros

source: Imported {} localroles
es: Importados {} roles locales

source: Imported {} orders in {} seconds
es: Importados {} ordenes en {} segundos

source: Imports
es: Importaciones

source: Include blobs
es: Incluir blobs

source: Include revisions.
es: Incluir revisiones.

source: Modify exported data for migrations.
es: Modificar datos exportados para migraciones.

source: More code is needed if you have another use case.
es: Se necesita más código si tiene otro caso de uso.

source: No data to export for {}
es: No hay datos para exportar {}

source: No files found.
es: No se encontraron archivos.

source: Path
es: Ruta

source: Redirects imported
es: Redirecciones importadas

source: Replace: Delete item and create new
es: Reemplazar: Eliminar elemento y crear nuevo

source: Reset created and modified dates
es: Restablecer fechas de creación y modificación

source: Reset creation and modification date
es: Restablecer fecha de creación y modificación

source: Save to file on server
es: Guardar en un archivo en el servidor

source: Select all/none
es: Seleccionar todo/ninguno

source: Select at least one type to export
es: Seleccione al menos un tipo para exportar

source: Select which content to export as a json-file.
es: Seleccione qué contenido exportar como un archivo json.

source: Skip: Don't import at all
es: Omitir: no importar en absoluto

source: This exports the content-history (versioning) of each exported item. Warning: This can significantly slow down the export!
es: Esto exporta el historial de contenido (versiones) de cada elemento exportado. Advertencia: ¡Esto puede ralentizar significativamente la exportación!

source: This will import the content-history (versioning) for each item that has revisions. Warning: This can significantly slow down the import!
es: Esto importará el historial de contenido (versiones) para cada elemento que tenga revisiones. Advertencia: ¡Esto puede ralentizar significativamente la importación!

source: Unlimited: this item and all children, 0: this object only, 1: only direct children of this object, 2-x: children of this object up to the specified level
es: Ilimitado: este elemento y todos los elementos secundarios, 0: solo este objeto, 1: solo elementos secundarios directos de este objeto, 2-x: elementos secundarios de este objeto hasta el nivel especificado

source: Update: Reuse and only overwrite imported data
es: Actualizar: reutilizar y solo sobrescribir datos importados

source: Use this if you want to import the data in a newer version of Plone or migrate from Archetypes to Dexterity. Read the documentation to learn which changes are made by this option.
es: Use esto si desea importar los datos en una versión más nueva de Plone o migrar de Archetypes a Dexterity. Lea la documentación para saber qué cambios se realizan con esta opción.

source: You need either Plone 6 or collective.relationhelpers to import relations
es: Necesitas Plone 6 o collective.relationhelpers para importar relaciones

source: as base-64 encoded strings
es: como cadenas codificadas en base 64

source: as blob paths
es: como rutas de blob

source: as download urls
es: como urls de descarga

source: export
es: exportar

source: json file was uploaded, so the selected server file was ignored.
es: archivo json se cargó, por lo que se ignoró el archivo del servidor seleccionado.

source: label_toggle
es: Alternar todo

source: plone.app.querystring.upgrades.fix_select_all_existing_collections is not available
es: plone.app.querystring.upgrades.fix_select_all_existing_collections no está disponible

source: server_paths_list
es: O puede elegir un archivo que ya está cargado en el servidor en una de estas rutas:

source: unlimited
es: ilimitado
