Repository: pypi-data/pypi-mirror-362
Catalog: packages/pyams-alchemy/pyams_alchemy-2.3.1.tar.gz/pyams_alchemy-2.3.1/src/pyams_alchemy/locales/*/LC_MESSAGES/pyams_alchemy.po
Languages: fr

source: Engine name
fr: Nom de la connexion

source: Keep empty if this engine is the default engine...
fr: Vous pouvez laisser ce champ vide pour créer une connexion "par défaut"...

source: RFC-1738 compliant URL for the database connection
fr: URL (format RFC-1738) de connexion à la base de données ; en général, sous la forme : driver://user:passwd@host:port/dbname, mais le format peut varier en fonction de la base de données

source: Echo SQL?
fr: Traces SQL ?

source: Log all SQL statements to system logger
fr: Mettre toutes les traces d'exécution SQL dans les logs du système

source: Use connections pool?
fr: Utiliser un pool de connexion ?

source: If 'no', collections pooling will be disabled
fr: Si 'non', l'utilisation de pools de connexions sera désactivée

source: Pool size
fr: Taille du pool

source: SQLAlchemy connections pool size
fr: Nombre de connexion conservées dans le pool

source: Pool recycle time
fr: Durée de recyclage

source: SQLAlchemy connection recycle time (-1 for none)
fr: Temps (en secondes) avant qu'une connexion intégrée dans le pool ne soit automatiquement réinitialisée ; indiquer -1 pour ne pas recycler les connexions

source: Echo pool?
fr: Traces du pool ?

source: Log all pool checkouts/checkins to system logger?
fr: Mettre une trace dans les logs système lorsqu'une connexion est sortie du pool

source: Two-phases commit?
fr: Commit en deux phases

source: Disable this option if two-phases commits should be disabled (for SQLite for example)
fr: Habituellement, les transactions SQL sont imbriquées au sein des transactions HTTP via un processus de commit dit "en deux phases", qui permet d'avoir une gestion globale de l'ensemble de la transaction ; vous pouvez désactiver cette option pour des besoins spécifiques, ou si le moteur de bases de données ne supporte pas cette fonctionnalité (pour SQLite par exemple)

source: SQL managers
fr: Gestionnaires SQL

source: Manage SQL engines properties
fr: Gérer les connexions SQL

source: SQL engines manager (role)
fr: Gestionnaire SQL (role)

source: SQL connections
fr: Connexions SQL

source: SQL engines
fr: Connexions SQL

source: List of SQL engines
fr: Liste des connexions SQL

source: An SQLAlchemy engine is already registered with this name!
fr: Une connexion SQL a déjà été enregistrée avec ce nom !

source: Add SQL engine
fr: Ajouter une connexion SQL

source: New SQL engine
fr: Nouvelle connexion

source: New engine properties
fr: Propriétés de la connexion

source: SQL engine: {}
fr: Connexion : {}

source: SQL engine properties
fr: Propriétés de la connexion SQL

source: Clone SQL engine
fr: Dupliquer la connexion

source: Clone SQL connection
fr: Dupliquer une connexion SQL

source: Test engine
fr: Test SQL

source: SQL query
fr: Requête SQL

source: Enter valid SQL code; WARNING: query will NOT be committed!!
fr: Veuillez saisir un code SQL valide ; ATTENTION : la transaction ne sera pas validée en cas de mise à jour !!

source: Execute query
fr: Exécuter la requête

source: Close
fr: Fermer

source: SQL test
fr: Test SQL

source: Test SQLAlchemy engine
fr: Test de la connexion SQL

source: Request results contains more than {batch} records; only the first records are displayed.
fr: La requête a renvoyé plus de {batch} résultats ; seuls les premiers enregistrement sont affichés.

source: SQLAlchemy engine test
fr: Test de la connexion SQL

source: SQL query results
fr: Résultats de la requête SQL

source: SQL session name
fr: Nom de la connexion

source: Name of the SQLAlchemy engine used to access database
fr: Nom de la connexion SQLAlchemy enregistrée pour accéder à la base de données

source: SQL query text
fr: Requête SQL

source: You can include dynamic fragments into your SQL code using PyAMS text renderers rules (see documentation)
fr: Vous pouvez intégrer des éléments dynamiques dans le code SQL en appliquant les règles des outils de formatage de texte proposés par PyAMS (Cf documentation)

source: Query params
fr: Paramètres de la requête

source: Query parameters can be entered in JSON format as a simple object or as a list of objects
fr: Vous pouvez fournir les paramètres de la requête au format JSON, sous la forme d'un objet unique ou d'une liste d'objets

source: Log output
fr: Intégrer le résultat dans l'historique

source: If 'no', output will be available as input values inside a pipeline but won't be logged into task execution report
fr: Si 'non', les résultats de la requête ne seront pas intégrés dans l'historique d'exécution de la tâche ; ces résultats pourront toujours être utilisés comme paramètres d'entrée d'une autre tâche dans le cas d'un pipeline

source: Output format
fr: Format de sortie

source: Format into which query output should be returned
fr: Format dans lequel le résultat de la requête doit être renvoyé

source: SQL task settings
fr: Commande SQL

source: Select connection name...
fr: Pas de connexion sélectionnée

source: Add SQL query...
fr: Requête SQL
