Repository: pypi-data/pypi-mirror-362
Catalog: packages/indico-plugin-owncloud/indico_plugin_owncloud-3.3.3-py3-none-any.whl/indico_owncloud/translations/*/LC_MESSAGES/messages.po
Languages: de_de, hu_hu, ja_jp

source: Attachment added
de_de: Angehängte Datei
hu_hu: Csatolmány hozzáadva
ja_jp: 添付が追加されました

source: Files
de_de: Datei(en)
hu_hu: Fájlok
ja_jp: ファイル

source: File-picker URL
de_de: Dateiauswahl-URL
hu_hu: Fájl-kiválasztó URL
ja_jp: File-pickerのURL

source: Service name
de_de: Dienstname
hu_hu: Szolgáltatás neve
ja_jp: サービス名

source: A customized name for the cloud service. If empty, the default 'The cloud' will be used.
de_de: Ein benutzerdefinierter Name für den Cloud-Dienst. Ist er leer, wird der Standardname „The cloud“ verwendet.
hu_hu: A felhőszolgáltatás testreszabott neve. Ha üres, akkor az alapértelmezett 'A felhő' lesz használva.
ja_jp: クラウドサービスのカスタム名。空にするとデフォルトの「クラウド」が使われます。

source: Custom icon URL
de_de: URL des benutzerdefinierten Symbols
hu_hu: Egyéni ikon URL-címe
ja_jp: カスタムアイコンURL

source: URL for a customized icon to show in the add attachment button. If empty, the default cloud icon will be used
de_de: URL für ein benutzerdefiniertes Symbol, das in der Schaltfläche "Anhang hinzufügen" angezeigt werden soll. Wenn leer, wird das standardmäßige Cloud-Symbol verwendet.
hu_hu: A melléklet hozzáadása gombon megjelenítendő egyedi ikon URL-címe. Ha üres, akkor az alapértelmezett felhő ikon lesz használva.
ja_jp: 添付追加のボタンに表示するカスタムアイコンへのURL。空にするとデフォルトのクラウドアイコンが使われます。

source: Add
de_de: Hinzufügen
hu_hu: Hozzáadás
ja_jp: 追加

source: Cancel
de_de: Abbrechen
hu_hu: Elvetés
ja_jp: キャンセル

source: the cloud
de_de: die Cloud
hu_hu: a felhő
ja_jp: クラウド

source: Add files from %(service_name)s
de_de: Dateien hinzufügen von %(service_name)s
hu_hu: Fájlok hozzáadása innen: %(service_name)s
ja_jp: %(service_name)sからファイルを追加

source: From %(service_name)s
de_de: Von %(service_name)s
hu_hu: Innen: %(service_name)s
ja_jp: %(service_name)sから
